komp1 = {
    1: 'логические действия',
    2: 'критическое мышление',
    3: 'креативное мышление',
    4: 'коммуникация',
    5: 'коллаборация',
    10: 'управление мотивацией и эмоциями',
    11: 'самоорганизация',
}

komp23 = {
    1: 'логические действия',
    2: 'критическое мышление',
    3: 'креативное мышление',
    4: 'коммуникация',
    5: 'коллаборация',
    7: 'планирование',
    10: 'управление мотивацией и эмоциями',
    11: 'самоорганизация',
}

komp411 = {
    1: 'логические действия',
    2: 'критическое мышление',
    3: 'креативное мышление',
    4: 'коммуникация',
    5: 'коллаборация',
    6: 'целеполагание',
    7: 'планирование',
    8: 'саморегуляция',
    9: 'самооценивание и рефлексия',
}
##########################################
#'В.1': 1, 'В.2': 2, 'В.3': 1, 'В.4': 8, 'В.5': 7, 'В.6': 1,
sl_1_individ = [1, 4, 5, 10, 2, 2, 10, 3]
sl_23_individ = [1, 10, 3, 4, 5, 2, 2, 4, 4]
sl_45_individ = [1, 2, 1, 8, 7, 1]
sl_67_individ = [1, 2, 1, 2, 4, 3]
sl_811_individ = [1, 2, 2, 2, 3, 4]

sl_group = [6, 4, 5, 3, 5, 7, 5, 4, 5, 9]
sl_23_group = [5, 11, 1, 4, 11, 11, 10, 7, 10, 11, 11, 5, 5, 10]
sl_1_group = [4, 1, 4, 10, 11, 5, 11, 10, 10, 11, 10, 5, 11, 10]